# Beginning Data Analysis

In [2]:
import pandas as pd
import numpy as np

## Developing a data analysis routine

In [3]:
college = pd.read_csv('data/college.csv')
college.head()

,Unnamed: 0,Private,Apps,Accept,Enroll,Top10perc,Top25perc,F.Undergrad,P.Undergrad,Outstate,Room.Board,Books,Personal,PhD,Terminal,S.F.Ratio,perc.alumni,Expend,Grad.Rate
0,Abilene Christian University,Yes,1660,1232,721,23,52,2885,537,7440,3300,450,2200,70,78,18.1,12,7041,60
1,Adelphi University,Yes,2186,1924,512,16,29,2683,1227,12280,6450,750,1500,29,30,12.2,16,10527,56
2,Adrian College,Yes,1428,1097,336,22,50,1036,99,11250,3750,400,1165,53,66,12.9,30,8735,54
3,Agnes Scott College,Yes,417,349,137,60,89,510,63,12960,5450,450,875,92,97,7.7,37,19016,59
4,Alaska Pacific University,Yes,193,146,55,16,44,249,869,7560,4120,800,1500,76,72,11.9,2,10922,15

In [5]:
college.shape

(777, 19)

 After this, use **info()** method for listing the **dtype** for each column, number of **non missing values** and **memory usage**

In [6]:
college.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 777 entries, 0 to 776
Data columns (total 19 columns):
Unnamed: 0     777 non-null object
Private        777 non-null object
Apps           777 non-null int64
Accept         777 non-null int64
Enroll         777 non-null int64
Top10perc      777 non-null int64
Top25perc      777 non-null int64
F.Undergrad    777 non-null int64
P.Undergrad    777 non-null int64
Outstate       777 non-null int64
Room.Board     777 non-null int64
Books          777 non-null int64
Personal       777 non-null int64
PhD            777 non-null int64
Terminal       777 non-null int64
S.F.Ratio      777 non-null float64
perc.alumni    777 non-null int64
Expend         777 non-null int64
Grad.Rate      777 non-null int64
dtypes: float64(1), int64(16), object(2)
memory usage: 115.4+ KB

Then run **statistical summary** and transpose the DataFrame. Don't forget to add the attribute *include* and say to *describe()*, through *np.number*, to consider only numerical values.

In [10]:
college.describe(include=[np.number]).T

,count,mean,std,min,25%,50%,75%,max
Apps,777.0,3001.638353,3870.201484,81.0,776.0,1558.0,3624.0,48094.0
Accept,777.0,2018.804376,2451.113971,72.0,604.0,1110.0,2424.0,26330.0
Enroll,777.0,779.972973,929.176190,35.0,242.0,434.0,902.0,6392.0
Top10perc,777.0,27.558559,17.640364,1.0,15.0,23.0,35.0,96.0
Top25perc,777.0,55.796654,19.804778,9.0,41.0,54.0,69.0,100.0
F.Undergrad,777.0,3699.907336,4850.420531,139.0,992.0,1707.0,4005.0,31643.0
P.Undergrad,777.0,855.298584,1522.431887,1.0,95.0,353.0,967.0,21836.0
Outstate,777.0,10440.669241,4023.016484,2340.0,7320.0,9990.0,12925.0,21700.0
Room.Board,777.0,4357.526384,1096.696416,1780.0,3597.0,4200.0,5050.0,8124.0
Books,777.0,549.380952,165.105360,96.0,470.0,500.0,600.0,2340.0
Personal,777.0,1340.642214,677.071454,250.0,850.0,1200.0,1700.0,6800.0
PhD,777.0,72.660232,16.328155,8.0,62.0,75.0,85.0,103.0
Terminal,777.0,79.702703,14.722359,24.0,71.0,82.0,92.0,100.0
S.F.Ratio,777.0,14.089704,3.958349,2.5,11.5,13.6,16.5,39.8
perc.alumni,777.0,22.743887,12.391801,0.0,13.0,21.0,31.0,64.0
Expend,777.0,9660.171171,5221.768440,3186.0,6751.0,8377.0,10830.0,56233.0
Grad.Rate,777.0,65.463320,17.177710,10.0,53.0,65.0,78.0,118.0

In order to output the exact percentage, do the following

In [15]:
with pd.option_context('display.max_rows', 5):
    display(college.describe(include=[np.number], percentiles=[.01, .05, .10, .25, .5, .75, .9, .95, .99]).T)

,count,mean,std,min,1%,5%,10%,25%,50%,75%,90%,95%,99%,max
Apps,777.0,3001.638353,3870.201484,81.0,192.52,329.8,457.6,776.0,1558.0,3624.0,7675.0,11066.2,16026.12,48094.0
Accept,777.0,2018.804376,2451.113971,72.0,146.00,272.4,361.6,604.0,1110.0,2424.0,4814.2,6979.2,11668.08,26330.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Expend,777.0,9660.171171,5221.768440,3186.0,3869.32,4795.8,5558.2,6751.0,8377.0,10830.0,14841.0,17974.8,31335.48,56233.0
Grad.Rate,777.0,65.463320,17.177710,10.0,23.52,37.0,44.6,53.0,65.0,78.0,89.0,94.2,100.00,118.0

Now let's get summary statistic for the **object** and **categorical** columns

In [12]:
college.describe(include=[np.object, pd.Categorical]).T

           count unique                 top freq
Unnamed: 0   777    777  Mercyhurst College    1
Private      777      2                 Yes  565

In [27]:
college['Private'].value_counts()

Yes    565
No     212
Name: Private, dtype: int64

## Reducing memory by changing data types

In [28]:
college.dtypes

Unnamed: 0      object
Private         object
Apps             int64
Accept           int64
Enroll           int64
Top10perc        int64
Top25perc        int64
F.Undergrad      int64
P.Undergrad      int64
Outstate         int64
Room.Board       int64
Books            int64
Personal         int64
PhD              int64
Terminal         int64
S.F.Ratio      float64
perc.alumni      int64
Expend           int64
Grad.Rate        int64
dtype: object

First, get a subset of object dtype columns and all that columns that assume a low integer value (as small integer value are small, is not necessary to store them with 64 bits. Take into account for instance columns *Top10perc* and *Top25perc*)

In [59]:
college = pd.read_csv('data/college.csv')
different_cols = ['Unnamed: 0', 'Private', 'Top10perc', 'Top25perc']
col2 = college.loc[:, different_cols]
col2.head()

                     Unnamed: 0 Private  Top10perc  Top25perc
0  Abilene Christian University     Yes         23         52
1            Adelphi University     Yes         16         29
2                Adrian College     Yes         22         50
3           Agnes Scott College     Yes         60         89
4     Alaska Pacific University     Yes         16         44

Go ahead and find the memory usage for each column with **memory_usage()** method. For Pandas, to extract the amount of memory of an object dtype column, the **deep** parameter must be set to *True* in the memory_usage() method

In [60]:
memory_usage_cols2 = col2.memory_usage(deep=True)
memory_usage_cols2

Index            80
Unnamed: 0    61520
Private       46408
Top10perc      6216
Top25perc      6216
dtype: int64

There is no need to use *int64* bits for Top10perc and for Top25perc as they assume really low values. Let's convert these colums dtypes into **int8** bits using **astype()** method

In [61]:
col2['Top10perc'] = col2['Top10perc'].astype(np.int8)
col2['Top25perc'] = col2['Top25perc'].astype(np.int8)

In [36]:
col2.dtypes

Unnamed: 0    object
Private       object
Top10perc       int8
Top25perc       int8
dtype: object

Check the memory usage and see the large reducion

In [62]:
memory_usage_cols2_2 = col2.memory_usage(deep=True)
memory_usage_cols2_2

Index            80
Unnamed: 0    61520
Private       46408
Top10perc       777
Top25perc       777
dtype: int64

In [63]:
col2.describe(include=[np.object, pd.Categorical]).T

           count unique                 top freq
Unnamed: 0   777    777  Mercyhurst College    1
Private      777      2                 Yes  565

As it can be seen above, the *Private* column has only two unique values and it is an *object* dtype. Since has a lower unique values, the memory usage of that column can be reduced changing the object dtype to **caegory** dtype

Another way to check the amount of unique values per column is the following

In [39]:
col2.select_dtypes(include=['object']).nunique()

Unnamed: 0    777
Private         2
dtype: int64

In [64]:
col2['Private'] = col2['Private'].astype('category')
col2.dtypes

Unnamed: 0      object
Private       category
Top10perc         int8
Top25perc         int8
dtype: object

In [65]:
new_memory_usage_cols2 = col2.memory_usage(deep=True)
new_memory_usage_cols2

Index            80
Unnamed: 0    61520
Private         976
Top10perc       777
Top25perc       777
dtype: int64

As it can be seen, the usage memory for Private column has shrunk considerably

Now let's compare the original memory usage with our update memory usage

In [66]:
new_memory_usage_cols2

Index            80
Unnamed: 0    61520
Private         976
Top10perc       777
Top25perc       777
dtype: int64

In [67]:
new_memory_usage_cols2 / memory_usage_cols2

Index         1.000000
Unnamed: 0    1.000000
Private       0.021031
Top10perc     0.125000
Top25perc     0.125000
dtype: float64

We can notice how much the columns *Private*, *Top10perc* and *Top25perc* had reduced their memory usage, super!

## Selecting the smallest of the largest

In [5]:
movie = pd.read_csv('../section1/data/movies.csv')
movie2 = movie[['Film', 'Audience score %', 'Profitability']]
movie2.head()

                                 Film  Audience score %  Profitability
0          Zack and Miri Make a Porno                70       1.747542
1                     Youth in Revolt                52       1.090000
2  You Will Meet a Tall Dark Stranger                35       1.211818
3                        When in Rome                44       0.000000
4               What Happens in Vegas                72       6.267647

Then, use them method **nlargest(n, 'column_name')** to find the n (integer value) largest values of the column *column_name* (string value)

In [6]:
movie2.nlargest(10, 'Audience score %')

                                   Film  Audience score %  Profitability
6                                WALL-E                89       2.896019
74                   A Dangerous Method                89       0.448645
22                              Tangled                88       1.365692
39                 My Week with Marilyn                84       0.825800
43                    Midnight in Paris                84       8.744706
72                  Across the Universe                84       0.652603
54                           Knocked Up                83       6.636402
12                             Twilight                82      10.180027
31                      P.S. I Love You                82       5.103117
20  The Curious Case of Benjamin Button                81       1.783944

Now, we want to find out which between the films that had the higher *Audience score %* has the lowest *Profitability*. For this purpose, chain to the previous method the method **nsmallest(n, 'column_name')**

In [7]:
movie2.nlargest(10, 'Audience score %').nsmallest(5, 'Profitability')

                                   Film  Audience score %  Profitability
74                   A Dangerous Method                89       0.448645
72                  Across the Universe                84       0.652603
39                 My Week with Marilyn                84       0.825800
22                              Tangled                88       1.365692
20  The Curious Case of Benjamin Button                81       1.783944

## Selecting the largest of each group by sorting

**Question**: find the highest rated film of each year

In [8]:
movie = pd.read_csv('../section1/data/movies.csv')
movie2 = movie[['Film', 'Year','Audience score %']]
movie2.head()

                                 Film    Year  Audience score %
0          Zack and Miri Make a Porno  2008.0                70
1                     Youth in Revolt  2010.0                52
2  You Will Meet a Tall Dark Stranger  2010.0                35
3                        When in Rome  2010.0                44
4               What Happens in Vegas  2008.0                72

Sort the DataFrame per year using **sort_values('column_name', ascending=boolean)** method

In [10]:
movie2.sort_values('Year', ascending=False).head()

                  Film    Year  Audience score %
38      New Year's Eve  2011.0                48
43   Midnight in Paris  2011.0                84
23  Something Borrowed  2011.0                48
65   Gnomeo and Juliet  2011.0                52
34             One Day  2011.0                54

To sort most columns at once, use a list

In [14]:
movie3 = movie2.sort_values(['Year', 'Audience score %'], ascending=False)
movie3.head()

                    Film    Year  Audience score %
74    A Dangerous Method  2011.0                89
39  My Week with Marilyn  2011.0                84
43     Midnight in Paris  2011.0                84
71             Beginners  2011.0                80
57             Jane Eyre  2011.0                77

Now, use the **drop_duplicates(subset='column_name')** to keep only the first row of every *column_name*

In [16]:
movie_top_year = movie3.drop_duplicates(subset='Year')
movie_top_year

                           Film    Year  Audience score %
74           A Dangerous Method  2011.0                89
22                      Tangled  2010.0                88
14  The Twilight Saga: New Moon  2009.0                78
6                        WALL-E  2008.0                89
72          Across the Universe  2007.0                84
76         (500) Days of Summer     NaN                81